{
    "Weboldal": "Website",
    "Webshop": "Webshop",
    "Landing Page": "Landing Page",
    "Főoldal": "Home",
    "Kapcsolat": "Contact",
    "Termékeink": "Our Products",
    "Rólunk": "About Us",
    "Szolgáltatások": "Services",
    "Blog": "Blog",
    "Gyakori kérdések": "FAQ",
    "Adott oldalhoz esetleges igényelt képek feltöltése": "Upload possible required images for this page",
    "short_description": "Ideal choice for concise, quickly reviewable subpages, such as a brief service presentation or a contact page. Contains maximum 2 sections, each with 1 text box and 1 image.",
    "medium_description": "This option provides the opportunity to display more detailed information, with sufficient space for a more complex description of a product or service. Can contain maximum 5 images, 5 text boxes and 2 banners, ensuring optimal balance between text and visual elements.",
    "large_description": "The most comprehensive choice, perfect for detailed product pages and service presentations that provide thorough information. Can include up to 10 images and 10 text boxes, 5 banners, as well as elements like our benefits section, custom image-text compositions, countdown, what they say about us quotes, reviews, and product and service category integration.",
    "Rövid méretű előnézet": "Short size preview",
    "Közepes méretű előnézet": "Medium size preview",
    "Nagy méretű előnézet": "Large size preview",
    "graphics_project_description": "Please describe your website project in detail, with a maximum of 20,000 characters. Here you have the opportunity to share with us your ideas about the website's purpose, target audience, desired mood, preferred colors or style, as well as any other relevant information that can help understand the project. Please specify the website's specific functions and localization needs in the separate settings options at the bottom of the page.",
    "graphics_ui_question": "Do you already have a ready graphic design or visual design (UI) for your website?",
    "graphics_ui_what_is_title": "What is a graphic design / visual design (UI)?",
    "graphics_ui_explanation": "A graphic design or visual design (User Interface – UI) presents the visual appearance, layout and user interface of the website before development begins. This includes color schemes, typography, arrangement of images and texts, button appearance, and all visual components that define the user experience, thus providing a kind of digital blueprint for the website.",
    "contact_form_name": "Contact Form",
    "contact_form_description": "A simple web form through which visitors can send messages directly to you through the site without having to leave it.",
    "quote_form_name": "Quote Request Form",
    "quote_form_description": "Allows interested parties to request detailed quotes for specific products or services, recording all necessary information.",
    "popup_window_name": "Pop-up Window",
    "popup_window_description": "A popup interface that automatically appears to visitors when certain conditions are met (e.g. on arrival, before leaving), to display attention-grabbing messages or offers.",
    "newsletter_signup_name": "Newsletter Subscription",
    "newsletter_signup_description": "A built-in feature that allows visitors to subscribe to your email list to be notified of your news, promotions or updates. The service includes newsletter sending system integration.",
    "social_media_integration_name": "Social Media Integration",
    "search_function_name": "Search Function",
    "search_function_description": "A built-in search box that allows visitors to easily find content, products or services within the website.",
    "Kapcsolati űrlap": "Contact Form",
    "Egy egyszerű webes űrlap, amelyen keresztül a látogatók közvetlenül üzenetet küldhetnek Önnek az oldalon keresztül, anélkül, hogy el kellene hagyniuk azt.": "A simple web form through which visitors can send messages directly to you through the site without having to leave it.",
    "Árajánlatkérő űrlap": "Quote Request Form",
    "Lehetővé teszi az érdeklődők számára, hogy részletes árajánlatot kérjenek konkrét termékekre vagy szolgáltatásokra, rögzítve minden szükséges információt.": "Allows interested parties to request detailed quotes for specific products or services, recording all necessary information.",
    "Felugró ablak": "Pop-up Window",
    "Egy felugró felület, amely bizonyos feltételek teljesülése esetén automatikusan megjelenik a látogatók számára (pl. érkezéskor, távozás előtt), figyelemfelkeltő üzenetek vagy ajánlatok megjelenítésére.": "A popup interface that automatically appears to visitors when certain conditions are met (e.g. on arrival, before leaving), to display attention-grabbing messages or offers.",
    "Hírlevél feliratkozás": "Newsletter Subscription",
    "Beépített funkció, amely lehetővé teszi a látogatók számára, hogy feliratkozzanak az Ön e-mail listájára, hogy értesüljenek az Ön híreiről, akcióiról vagy frissítéseiről. A szolgáltatás tartalmazza a hírlevélküldő rendszer integrációját.": "A built-in feature that allows visitors to subscribe to your email list to be notified of your news, promotions or updates. The service includes newsletter sending system integration.",
    "Közösségi média integráció": "Social Media Integration",
    "Kereső funkció": "Search Function",
    "Beépített keresőmező, amely lehetővé teszi a látogatók számára, hogy könnyen megtalálják a tartalmakat, termékeket vagy szolgáltatásokat a weboldalon belül.": "A built-in search box that allows visitors to easily find content, products or services within the website.",
    "Funkciók": "Features",
    "Képgaléria": "Image Gallery",
    "Egy vizuális bemutató, amely lehetővé teszi több kép feltöltését és megjelenítését egy rendezett elrendezésben, gyakran használják portfóliókhoz vagy termékbemutatókhoz.": "A visual showcase that allows the upload and display of multiple images in an organized layout, often used for portfolios or product showcases.",
    "Videó beágyazás": "Video Embedding",
    "Lehetővé teszi videók beágyazását külső platformokról (pl. YouTube, Vimeo), hogy gazdagabb és interaktívabb tartalmat nyújtson a látogatók számára.": "Allows embedding videos from external platforms (e.g. YouTube, Vimeo) to provide richer and more interactive content for visitors.",
    "social_media_integration_description": "Integration with popular social media platforms to share content and increase engagement with visitors.",
    "Admin panel": "Admin Panel",
    "Teljes körű adminisztrációs felület a weboldal tartalmának kezeléséhez, felhasználók adminisztrálásához és beállítások módosításához.": "Comprehensive administration interface for managing website content, user administration and settings modification.",
    "Felhasználói regisztráció és bejelentkezés": "User Registration and Login",
    "Biztonságos felhasználói fiókkezelés regisztrációval, bejelentkezéssel és profilkezeléssel.": "Secure user account management with registration, login and profile management.",
    "Online fizetés": "Online Payment",
    "Biztonságos online fizetési rendszer integrálása (Stripe, PayPal, bankkártyás fizetés).": "Integration of secure online payment systems (Stripe, PayPal, credit card payment).",
    "Termék/szolgáltatás katalógus": "Product/Service Catalog",
    "Szervezett megjelenítés termékekhez vagy szolgáltatásokhoz kategorizálással, szűrési lehetőségekkel.": "Organized display for products or services with categorization and filtering options.",
    "Kosár funkció": "Shopping Cart Function",
    "Vásárlókosár funkció, amely lehetővé teszi a termékek kiválasztását és vásárlását.": "Shopping cart function that allows product selection and purchase.",
    "Raktárkezelés": "Inventory Management",
    "Termékek készletének nyomon követése és kezelése automatikus értesítésekkel.": "Tracking and managing product inventory with automatic notifications.",
    "Rendeléskezelés": "Order Management",
    "Teljes körű rendeléskezelő rendszer státuszkövetéssel és értesítésekkel.": "Comprehensive order management system with status tracking and notifications.",
    "Kupon rendszer": "Coupon System",
    "Kedvezmények és promóciók kezelése kuponkódokkal.": "Managing discounts and promotions with coupon codes.",
    "Értékelési rendszer": "Review System",
    "Termékek vagy szolgáltatások értékelésének lehetősége csillagos rendszerrel.": "Ability to rate products or services with star rating system.",
    "Többnyelvű támogatás": "Multi-language Support",
    "A weboldal megjelenítése több nyelven dinamikus nyelvi váltással.": "Displaying the website in multiple languages with dynamic language switching.",
    "SEO optimalizáció": "SEO Optimization",
    "Keresőmotor optimalizálás a jobb láthatóság érdekében.": "Search engine optimization for better visibility.",
    "Blog rendszer": "Blog System",
    "Teljes körű blog funkcionalitás cikkek írásához és kezeléséhez.": "Complete blog functionality for writing and managing articles.",
    "Eseménynaptár": "Event Calendar",
    "Interaktív naptár események megjelenítéséhez és kezeléséhez.": "Interactive calendar for displaying and managing events.",
    "Online foglalás": "Online Booking",
    "Időpontfoglalási rendszer szolgáltatások vagy események számára.": "Appointment booking system for services or events.",
    "Chat támogatás": "Chat Support",
    "Valós idejű chat funkció az ügyfélszolgálat számára.": "Real-time chat function for customer service.",
    "Fájlfeltöltés": "File Upload",
    "Lehetőség fájlok feltöltésére és megosztására.": "Ability to upload and share files.",
    "API integráció": "API Integration",
    "Külső szolgáltatások integrációja API-kon keresztül.": "Integration of external services through APIs.",
    "Analitika és jelentések": "Analytics and Reports",
    "Részletes használati statisztikák és jelentések generálása.": "Generating detailed usage statistics and reports.",
    "Mobil alkalmazás": "Mobile Application",
    "Dedikált mobil alkalmazás iOS és Android platformokra.": "Dedicated mobile application for iOS and Android platforms.",
    "Lehetővé teszi az érdeklődők számára, hogy specifikus termékekre vagy szolgáltatásokra kérjenek részletes árajánlatot, rögzítve az összes szükséges információt.": "Allows interested parties to request detailed quotes for specific products or services, recording all necessary information."
}